# Hands on LAB - SQL - COURSERA

This notebook records the main SQL practice commands of the IBM Data Science professional certification.
Unlike the execution in IBM's cloud based database environment, this notebook uses a Python library that encapsulates SQL.

# A | Composing and Running Basic SQL Queries

### Setup

In [ ]:
#importing library that encapsulates SQL in Python
import sqlite3

#Creating a variable to generate the database file
bd = sqlite3.connect('Coursera.db')

In [ ]:
#Creating a variable to easyly call the cursor
cursor = bd.cursor()

### Task 0: Drop the table INSTRUCTOR from the database in case it already exists, so that we start from a clean state.

In [ ]:
cursor.execute('''
              DROP TABLE IF EXISTS instructor
              ''')

### Task 1: Create the INSTRUCTOR table as defined above. Have the ins_id be the primary key, and ensure the lastname and firstname are not null.

(Hint: ins_id is of type INTEGER, country of type CHAR(2), and rest of the fields VARCHAR)

In [ ]:
cursor.execute('''
              CREATE TABLE IF NOT EXISTS instructor
              (ins_id INTEGER PRIMARY KEY NOT NULL,
              last_name VARCHAR(15) NOT NULL,
              first_name VARCHAR(15) NOT NULL,
              city VARCHAR(15),
              country CHAR(2)
              )
              ''')

In [ ]:
cursor.execute("PRAGMA table_info(instructor)").fetchall()

[(0, 'ins_id', 'INTEGER', 1, None, 1),
 (1, 'last_name', 'VARCHAR(15)', 1, None, 0),
 (2, 'first_name', 'VARCHAR(15)', 1, None, 0),
 (3, 'city', 'VARCHAR(15)', 0, None, 0),
 (4, 'country', 'CHAR(2)', 0, None, 0)]

### Task 2: Insert one row into the INSTRUCTOR table for the the instructor Rav Ahuja.

(Hint: values for the character fields require a singe quotation mark (') before and after each value)

In [ ]:
cursor.execute('''
              INSERT INTO instructor
              (ins_id, last_name,first_name, city, country)
              VALUES
              (1, 'Ahuja', 'Rav', 'Toronto', 'CA');
              ''')

### Task 2B: Insert two rows at once in the INSTRUCTOR table for instructors Raul Chong and Hima Vasudevan.

(Hint: list the values for the second row after the first row)

In [ ]:
cursor.execute('''
              INSERT INTO instructor
              VALUES
              (2, 'Chong', 'Raul', 'Toronto', 'CA'),
              (3, 'Vasudevan', 'Hima', 'Chicago', 'US');
              ''')

In [ ]:
#a different solution
# instructors = [(2, 'Chong', 'Raul', 'Toronto', 'CA'),(3, 'Vasudevan', 'Hima', 'Chicago', 'US')]
# cursor.executemany('INSERT INTO person VALUES(?, ?, ?, ?, ?)', instructors)

### Task 3: Select all rows from the INSTRUCTOR table.

In [ ]:
cursor.execute('SELECT * FROM instructor').fetchall()

[(1, 'Ahuja', 'Rav', 'Toronto', 'CA'),
 (2, 'Chong', 'Raul', 'Toronto', 'CA'),
 (3, 'Vasudevan', 'Hima', 'Chicago', 'US')]

### Task 3B: Select the firstname, lastname and country where the city is Toronto

In [ ]:
cursor.execute('SELECT first_name, last_name, country FROM instructor WHERE city = "Toronto"').fetchall()

[('Rav', 'Ahuja', 'CA'), ('Raul', 'Chong', 'CA')]

### Task 4: Update the row for Rav Ahuja and change his city to Markham.

In [ ]:
cursor.execute('SELECT * FROM instructor').fetchall()

[(1, 'Ahuja', 'Rav', 'Toronto', 'CA'),
 (2, 'Chong', 'Raul', 'Toronto', 'CA'),
 (3, 'Vasudevan', 'Hima', 'Chicago', 'US')]

In [ ]:
cursor.execute('UPDATE instructor SET city = "Markham" WHERE ins_id = 1').fetchall()

[]

In [ ]:
cursor.execute('SELECT * FROM instructor').fetchall()

[(1, 'Ahuja', 'Rav', 'Markham', 'CA'),
 (2, 'Chong', 'Raul', 'Toronto', 'CA'),
 (3, 'Vasudevan', 'Hima', 'Chicago', 'US')]

### Task 5: Delete the row for Raul Chong from the table.

In [ ]:
cursor.execute('SELECT * FROM instructor').fetchall()

[(1, 'Ahuja', 'Rav', 'Markham', 'CA'),
 (2, 'Chong', 'Raul', 'Toronto', 'CA'),
 (3, 'Vasudevan', 'Hima', 'Chicago', 'US')]

In [ ]:
cursor.execute('DELETE FROM instructor WHERE ins_id = 2').fetchall()

[]


### Task 5B: Retrieve all rows in the INSTRUCTOR table

In [ ]:
cursor.execute('SELECT * FROM instructor').fetchall()

[(1, 'Ahuja', 'Rav', 'Markham', 'CA'),
 (3, 'Vasudevan', 'Hima', 'Chicago', 'US')]

In [ ]:
bd.commit

In [ ]:
bd.close()

# B | String Patterns, Sorting & Grouping

## Set up

In [ ]:
#importing library that encapsulates SQL in Python
import sqlite3

#Creating a variable to generate the database file
bd = sqlite3.connect('Coursera.db')

In [ ]:
#Creating a variable to easyly call the cursor
cursor = bd.cursor()

## Creating tables

In [ ]:
#Creating a variable that create the 4 tables

SQL = """ 
          CREATE TABLE IF NOT EXISTS employees (
              emp_id CHAR(9) PRIMARY KEY NOT NULL, 
              f_name VARCHAR(15) NOT NULL,
              l_name VARCHAR(15) NOT NULL,
              ssn CHAR(9),
              b_date DATE,
              sex CHAR,
              address VARCHAR(30),
              job_id CHAR(9),
              salary DECIMAL(10,2),
              manager_id CHAR(9),
              dep_id CHAR(9) NOT NULL
              );
                            
        CREATE TABLE IF NOT EXISTS job_history (
              empl_id CHAR(9) PRIMARY KEY NOT NULL, 
              start_date DATE,
              jobs_id CHAR(9) NOT NULL,
              dept_id CHAR(9)
              );
 
        CREATE TABLE IF NOT EXISTS jobs (
              job_ident CHAR(9) PRIMARY KEY NOT NULL, 
              job_title VARCHAR(15) ,
              min_salary DECIMAL(10,2),
              max_salary DECIMAL(10,2)
              );

        CREATE TABLE IF NOT EXISTS departments (
              dept_id_dep CHAR(9) PRIMARY KEY NOT NULL, 
              dep_name VARCHAR(15),
              manager_id CHAR(9),
              loc_id CHAR(9)
              );

        CREATE TABLE IF NOT EXISTS locations (
              loct_id CHAR(9) PRIMARY KEY NOT NULL,
              dep_id_loc CHAR(9) NOT NULL
              );

        """

In [ ]:
cursor.executescript(SQL)

In [ ]:
#updating database
bd.commit()

## Created tables checking

In [ ]:
cursor.execute("PRAGMA table_info(employees)").fetchall()

[(0, 'emp_id', 'CHAR(9)', 1, None, 1),
 (1, 'f_name', 'VARCHAR(15)', 1, None, 0),
 (2, 'l_name', 'VARCHAR(15)', 1, None, 0),
 (3, 'ssn', 'CHAR(9)', 0, None, 0),
 (4, 'b_date', 'DATE', 0, None, 0),
 (5, 'sex', 'CHAR', 0, None, 0),
 (6, 'address', 'VARCHAR(30)', 0, None, 0),
 (7, 'job_id', 'CHAR(9)', 0, None, 0),
 (8, 'salary', 'DECIMAL(10,2)', 0, None, 0),
 (9, 'manager_id', 'CHAR(9)', 0, None, 0),
 (10, 'dep_id', 'CHAR(9)', 1, None, 0)]

In [ ]:
cursor.execute("PRAGMA table_info(job_history)").fetchall()

[(0, 'empl_id', 'CHAR(9)', 1, None, 1),
 (1, 'start_date', 'DATE', 0, None, 0),
 (2, 'jobs_id', 'CHAR(9)', 1, None, 0),
 (3, 'dept_id', 'CHAR(9)', 0, None, 0)]

In [ ]:
cursor.execute("PRAGMA table_info(jobs)").fetchall()

[(0, 'job_ident', 'CHAR(9)', 1, None, 1),
 (1, 'job_title', 'VARCHAR(15)', 0, None, 0),
 (2, 'min_salary', 'DECIMAL(10,2)', 0, None, 0),
 (3, 'max_salary', 'DECIMAL(10,2)', 0, None, 0)]

In [ ]:
cursor.execute("PRAGMA table_info(departments)").fetchall()

[(0, 'dept_id_dep', 'CHAR(9)', 1, None, 1),
 (1, 'dep_name', 'VARCHAR(15)', 0, None, 0),
 (2, 'manager_id', 'CHAR(9)', 0, None, 0),
 (3, 'loc_id', 'CHAR(9)', 0, None, 0)]

In [ ]:
cursor.execute("PRAGMA table_info(locations)").fetchall()

[(0, 'loct_id', 'CHAR(9)', 1, None, 1),
 (1, 'dep_id_loc', 'CHAR(9)', 1, None, 0)]

## Populating tables from CSV uploaded files

In [ ]:
import csv

In [ ]:
csv_file = open('/Users/thiagocarvalho/Documents/DataScience_BigData/Bootcamp_infnet/notebooks/SQL/Employees.csv')
employees_data = csv.reader(csv_file)

In [ ]:
cursor.executemany('INSERT INTO employees VALUES(?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?)', employees_data)

In [ ]:
csv_file = open('/Users/thiagocarvalho/Documents/DataScience_BigData/Coursera/SQL/Job_History.csv')
job_history_data = csv.reader(csv_file)

In [ ]:
cursor.executemany('INSERT INTO job_history VALUES(?, ?, ?, ?)', job_history_data)

In [ ]:
csv_file = open('/Users/thiagocarvalho/Documents/DataScience_BigData/Coursera/SQL/Jobs.csv')
jobs_data = csv.reader(csv_file)

In [ ]:
cursor.executemany('INSERT INTO jobs VALUES(?, ?, ?, ?)', jobs_data)

In [ ]:
csv_file = open('/Users/thiagocarvalho/Documents/DataScience_BigData/Coursera/SQL/Departaments.csv')
departments2_data = csv.reader(csv_file)

In [ ]:
cursor.executemany('INSERT INTO departments VALUES(?, ?, ?, ?)', departments2_data)
# in the original csv there were two departaments with the same Id and Name
# and a error result was found -> Unique constraint failed
# Solution: change the data record -> 2nd appearance of Software department code was 
#           manually set as 8 and named with a 2 at the end the CSV file and uploaded again.

In [ ]:
csv_file = open('/Users/thiagocarvalho/Documents/DataScience_BigData/Coursera/SQL/Location.csv')
locations_data = csv.reader(csv_file)

In [ ]:
cursor.executemany('INSERT INTO locations VALUES(?, ?)', locations_data)

In [ ]:
#updating database
bd.commit()

## Inserted data checking

In [ ]:
#creating function to print table lables on selects
def header(sql_table):
    data = cursor.execute(sql_table)
    header =[header[0] for header in data.description]
    print(header)
    for row in data:
      print(row)

In [ ]:
header("SELECT * FROM employees LIMIT 3")

['emp_id', 'f_name', 'l_name', 'ssn', 'b_date', 'sex', 'address', 'job_id', 'salary', 'manager_id', 'dep_id']
('E1001', 'John', 'Thomas', '123456', '01/09/1976', 'M', '5631 Rice, OakPark,IL', '100', 100000, '30001', '2')
('E1002', 'Alice', 'James', '123457', '07/31/1972', 'F', '980 Berry ln, Elgin,IL', '200', 80000, '30002', '5')
('E1003', 'Steve', 'Wells', '123458', '08/10/1980', 'M', '291 Springs, Gary,IL', '300', 50000, '30002', '5')

In [ ]:
header("SELECT * FROM job_history LIMIT 3")

['empl_id', 'start_date', 'jobs_id', 'dept_id']
('E1001', '08/01/2000', '100', '2')
('E1002', '08/01/2001', '200', '5')
('E1003', '08/16/2001', '300', '5')

In [ ]:
header("SELECT * FROM jobs LIMIT 3")

['job_ident', 'job_title', 'min_salary', 'max_salary']
('100', 'Sr. Architect', 60000, 100000)
('200', 'Sr. Software Developer', 60000, 80000)
('300', 'Jr.Software Developer', 40000, 60000)

In [ ]:
header("SELECT * FROM departments LIMIT 3")

['dept_id_dep', 'dep_name', 'manager_id', 'loc_id']
('2', 'Architect Group', '30001', 'L0001')
('5', 'Software Group', '30002', 'L0002')
('7', 'Design Team', '30003', 'L0003')

In [ ]:
header("SELECT * FROM locations LIMIT 3")

['loct_id', 'dep_id_loc']
('L0001', '2')
('L0002', '5')
('L0003', '7')

## QUERIES

#### Query 1: Retrieve all employees whose address is in Elgin,IL

In [ ]:
header("SELECT f_name, l_name FROM employees WHERE address LIKE '%Elgin,IL%'")

['f_name', 'l_name']
('Alice', 'James')
('Nancy', 'Allen')
('Ann', 'Jacob')

#### Query 2: Retrieve all employees who were born during the 1970's.

In [ ]:
header("SELECT f_name, l_name FROM employees WHERE b_date LIKE '%197%'")

['f_name', 'l_name']
('John', 'Thomas')
('Alice', 'James')
('Nancy', 'Allen')
('Mary', 'Thomas')

#### Query 3: Retrieve all employees in department 5 whose salary is between 60000 and 70000 .

In [ ]:
header("SELECT * FROM employees WHERE dep_id = 5 AND salary BETWEEN 60000 AND 70000")

['emp_id', 'f_name', 'l_name', 'ssn', 'b_date', 'sex', 'address', 'job_id', 'salary', 'manager_id', 'dep_id']
('E1004', 'Santosh', 'Kumar', '123459', '07/20/1985', 'M', '511 Aurora Av, Aurora,IL', '400', 60000, '30004', '5')
('E1010', 'Ann', 'Jacob', '123415', '03/30/1982', 'F', '111 Britany Springs,Elgin,IL', '220', 70000, '30004', '5')

#### Query 4A: Retrieve a list of employees ordered by department ID.

In [ ]:
header("SELECT f_name, l_name, dep_id FROM employees ORDER BY dep_id")

['f_name', 'l_name', 'dep_id']
('John', 'Thomas', '2')
('Ahmed', 'Hussain', '2')
('Nancy', 'Allen', '2')
('Alice', 'James', '5')
('Steve', 'Wells', '5')
('Santosh', 'Kumar', '5')
('Ann', 'Jacob', '5')
('Mary', 'Thomas', '7')
('Bharath', 'Gupta', '7')
('Andrea', 'Jones', '7')

#### Query 4B: Retrieve a list of employees ordered in descending order by department ID and within each department ordered alphabetically in descending order by last name.

In [ ]:
header("SELECT f_name, l_name, dep_id FROM employees ORDER BY dep_id DESC")

['f_name', 'l_name', 'dep_id']
('Mary', 'Thomas', '7')
('Bharath', 'Gupta', '7')
('Andrea', 'Jones', '7')
('Alice', 'James', '5')
('Steve', 'Wells', '5')
('Santosh', 'Kumar', '5')
('Ann', 'Jacob', '5')
('John', 'Thomas', '2')
('Ahmed', 'Hussain', '2')
('Nancy', 'Allen', '2')

#### Query 5A: For each department ID retrieve the number of employees in the department.

In [ ]:
header("SELECT dep_id, COUNT(f_name) as Employees FROM employees GROUP BY dep_id")

['dep_id', 'Employees']
('2', 3)
('5', 4)
('7', 3)

#### Query 5B: For each department retrieve the number of employees in the department, and the average employees salary in the department.

In [ ]:
header("SELECT dep_id, COUNT(f_name)as Employees, ROUND(AVG(salary)) as Salary_Average FROM employees GROUP BY dep_id")

['dep_id', 'Employees', 'Salary_Average']
('2', 3, 86667.0)
('5', 4, 65000.0)
('7', 3, 66667.0)

#### Query 5C: Label the computed columns in the result set of Query 5B as NUM_EMPLOYEES and AVG_SALARY.

In [ ]:
header("SELECT dep_id, COUNT(f_name)as NUM_EMPLOYEES, ROUND(AVG(salary)) as AVG_SALARY FROM employees \
GROUP BY dep_id")

['dep_id', 'NUM_EMPLOYEES', 'AVG_SALARY']
('2', 3, 86667.0)
('5', 4, 65000.0)
('7', 3, 66667.0)

#### Query 5D: In Query 5C order the result set by Average Salary.

In [ ]:
header("SELECT dep_id, COUNT(f_name)as NUM_EMPLOYEES, ROUND(AVG(salary)) as AVG_SALARY FROM employees \
GROUP BY dep_id \
ORDER BY AVG_SALARY")

['dep_id', 'NUM_EMPLOYEES', 'AVG_SALARY']
('5', 4, 65000.0)
('7', 3, 66667.0)
('2', 3, 86667.0)

#### Query 5E: In Query 5D limit the result to departments with fewer than 4 employees.

In [ ]:
header("SELECT dep_id, COUNT(f_name)as NUM_EMPLOYEES, ROUND(AVG(salary)) as AVG_SALARY FROM employees \
GROUP BY dep_id \
HAVING COUNT(f_name) < 4 \
ORDER BY AVG_SALARY ")

['dep_id', 'NUM_EMPLOYEES', 'AVG_SALARY']
('7', 3, 66667.0)
('2', 3, 86667.0)

#### BONUS Query 6: Similar to 4B but instead of department ID use department name. Retrieve a list of employees ordered by department name, and within each department ordered alphabetically in descending order by last name.

In [ ]:
header("SELECT D.dep_name, E.l_name, E.f_name FROM employees as E, departments as D \
WHERE E.dep_id = D.dept_id_dep \
ORDER BY D.dep_name, E.l_name DESC")

['dep_name', 'l_name', 'f_name']
('Architect Group', 'Thomas', 'John')
('Architect Group', 'Hussain', 'Ahmed')
('Architect Group', 'Allen', 'Nancy')
('Design Team', 'Thomas', 'Mary')
('Design Team', 'Jones', 'Andrea')
('Design Team', 'Gupta', 'Bharath')
('Software Group', 'Wells', 'Steve')
('Software Group', 'Kumar', 'Santosh')
('Software Group', 'James', 'Alice')
('Software Group', 'Jacob', 'Ann')

# C | Practice Aggregate, Scalar, String, Date & Time Functions

## Set up

In [ ]:
#importing library that encapsulates SQL in Python
import sqlite3

#Creating a variable to generate the database file
bd = sqlite3.connect('Coursera.db')

In [ ]:
#Creating a variable to easyly call the cursor
cursor = bd.cursor()

## Creating tables

In [ ]:
#Creating a variable that create the table

framework = """ 
          CREATE TABLE IF NOT EXISTS petrescue (
              id INTEGER PRIMARY KEY NOT NULL,
              animal VARCHAR(20),
              quantity INTEGER,
              cost DECIMAL(6,2),
              rescue DATE
              );
        """

In [ ]:
cursor.executescript(framework)

In [ ]:
# Created table checking
cursor.execute("PRAGMA table_info(petrescue)").fetchall()

[(0, 'id', 'INTEGER', 1, None, 1),
 (1, 'animal', 'VARCHAR(20)', 0, None, 0),
 (2, 'quantity', 'INTEGER', 0, None, 0),
 (3, 'cost', 'DECIMAL(6,2)', 0, None, 0),
 (4, 'rescue', 'DATE', 0, None, 0)]

## Inserting data

In [ ]:
data = [(1,'Cat',9,450.09,'2018-05-29'), (2,'Dog',3,666.66,'2018-06-01'), (3,'Dog',1,100.00,'2018-06-04'),(4,'Parrot',2,50.00,'2018-06-04'), (5,'Dog',1,75.75,'2018-06-10'), (6,'Hamster',6,60.60,'2018-06-11'), (7,'Cat',1,44.44,'2018-06-11'),(8,'Goldfish',24,48.48,'2018-06-14'), (9,'Dog',2,222.22,'2018-06-15')]

In [ ]:
cursor.executemany('INSERT INTO petrescue VALUES(?, ?, ?, ?, ?)', data)

#### Inserted data checking

In [ ]:
#creating function to print table lables on selects
def header(sql_table):
    data = cursor.execute(sql_table)
    header =[header[0] for header in data.description]
    print(header)
    for row in data:
      print(row)

In [ ]:
header("SELECT * FROM petrescue")

['id', 'animal', 'quantity', 'cost', 'rescue']
(1, 'Cat', 9, 450.09, '2018-05-29')
(2, 'Dog', 3, 666.66, '2018-06-01')
(3, 'Dog', 1, 100, '2018-06-04')
(4, 'Parrot', 2, 50, '2018-06-04')
(5, 'Dog', 1, 75.75, '2018-06-10')
(6, 'Hamster', 6, 60.6, '2018-06-11')
(7, 'Cat', 1, 44.44, '2018-06-11')
(8, 'Goldfish', 24, 48.48, '2018-06-14')
(9, 'Dog', 2, 222.22, '2018-06-15')

## QUERIES

### A | Solutions: Aggregate Functions

#### Query A1: Enter a function that calculates the total cost of all animal rescues in the PETRESCUE table.

In [ ]:
header("SELECT SUM(cost) as Total_Cost FROM petrescue")

['Total_Cost']
(1718.24,)

#### Query A2: Enter a function that displays the total cost of all animal rescues in the PETRESCUE table in a column called SUM_OF_COST.

In [ ]:
header("SELECT SUM(cost) as SUM_OF_COST FROM petrescue")

['SUM_OF_COST']
(1718.24,)

#### Query A3: Enter a function that displays the maximum quantity of animals rescued.

In [ ]:
header("SELECT MAX(quantity) as MAX_QUANT FROM petrescue")

['MAX_QUANT']
(24,)

#### Query A4: Enter a function that displays the average cost of animals rescued.

In [ ]:
header("SELECT ROUND(AVG(cost),2) as AVG_COST FROM petrescue")

['AVG_COST']
(190.92,)

#### Query A5: Enter a function that displays the average cost of rescuing a dog.

In [ ]:
header("SELECT ROUND(AVG(cost / quantity),2) as AVG_COST_EACH_DOG FROM petrescue")

['AVG_COST_EACH_DOG']
(71.18,)

### B | Scalar and String Functions

#### Query B1: Enter a function that displays the rounded cost of each rescue.

In [ ]:
header("SELECT ROUND(cost) as ROUNDED_COST_EACH_RESCUE FROM petrescue")

['ROUNDED_COST_EACH_RESCUE']
(450.0,)
(667.0,)
(100.0,)
(50.0,)
(76.0,)
(61.0,)
(44.0,)
(48.0,)
(222.0,)

#### Query B2: Enter a function that displays the length of each animal name.

In [ ]:
header("SELECT LENGTH(animal) as Length_of_each_animal FROM petrescue")

['Length_of_each_animal']
(3,)
(3,)
(3,)
(6,)
(3,)
(7,)
(3,)
(8,)
(3,)

#### Query B3: Enter a function that displays the animal name in each rescue in uppercase.

In [ ]:
header("SELECT upper(animal) as ANIMAL FROM petrescue")

['ANIMAL']
('CAT',)
('DOG',)
('DOG',)
('PARROT',)
('DOG',)
('HAMSTER',)
('CAT',)
('GOLDFISH',)
('DOG',)

#### Query B4: Enter a function that displays the animal name in each rescue in uppercase without duplications.

In [ ]:
header("SELECT DISTINCT(upper(animal)) as DISTINCT_ANIMALS FROM petrescue")

['DISTINCT_ANIMALS']
('CAT',)
('DOG',)
('PARROT',)
('HAMSTER',)
('GOLDFISH',)

#### Query B5: Enter a query that displays all the columns from the PETRESCUE table, where the animal(s) rescued are cats. Use cat in lower case in the query.

In [ ]:
header("SELECT * FROM petrescue WHERE lower(animal) = 'cat'")

['id', 'animal', 'quantity', 'cost', 'rescue']
(1, 'Cat', 9, 450.09, '2018-05-29')
(7, 'Cat', 1, 44.44, '2018-06-11')

### C | Date and Time Functions

#### Query C1: Enter a function that displays the day of the month when cats have been rescued.

In [ ]:
cursor.execute("SELECT strftime('%d', rescue) FROM petrescue WHERE animal = 'Cat'").fetchall()

[('29',), ('11',)]

#### Query C2: Enter a function that displays the number of rescues on the 5th month.

In [ ]:
header("SELECT SUM(quantity) FROM petrescue WHERE strftime('%m', rescue) = '05'")

['SUM(quantity)']
(9,)

#### Query C3: Enter a function that displays the number of rescues on the 14th day of the month.

In [ ]:
header("SELECT SUM(quantity) as Rescues_on_14h FROM petrescue WHERE strftime('%d', rescue) = '14'")

['Rescues_on_14h']
(24,)

#### Query C4: Animals rescued should see the vet within three days of arrivals. Enter a function that displays the third day from each rescue.

In [ ]:
header("SELECT rescue, date(rescue, '3 days') as Vet_appointment FROM petrescue")

['rescue', 'Vet_appointment']
('2018-05-29', '2018-06-01')
('2018-06-01', '2018-06-04')
('2018-06-04', '2018-06-07')
('2018-06-04', '2018-06-07')
('2018-06-10', '2018-06-13')
('2018-06-11', '2018-06-14')
('2018-06-11', '2018-06-14')
('2018-06-14', '2018-06-17')
('2018-06-15', '2018-06-18')

#### Query C5: Enter a function that displays the length of time the animals have been rescued; the difference between today’s date and the recue date.

In [ ]:
header("select TRUNC('now') - rescue from petrescue")

OperationalError: ignored

In [ ]:
header(" SELECT CAST(( julianday('now') - julianday(rescue) )as integer) as days FROM petrescue;")

['days']
(1008,)
(1005,)
(1002,)
(1002,)
(996,)
(995,)
(995,)
(992,)
(991,)